/**************************************************************************************
*		              本文件用于51单片机的指纹锁												  *
实现现象：下载程序后D1指示灯点亮
注意事项：无																				  
***************************************************************************************/


#include "reg52.h"    //此文件中定义了单片机的一些特殊功能寄存器
#include "common.h"
#include "main.h"
#include "fp_module.h"
#include "uart.h"
#include "drive.h"

/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/
void main()
{
	Restart_Init();
	while(1)
	{
		 FP_Process();
	}		
}
